//Задача 6:  
 int a;
Console.WriteLine("Введите число: ");
a = Convert.ToInt32(Console.ReadLine());

if (a % 2==0)
{
   Console.WriteLine("Число чётное");
}
else
{
   Console.WriteLine("Число нечётное");
}